namespace ClassesTasks
{
    public class Second
    {
        /* Напишите программу с классом, у которого есть два символьных поля и метод. Он не возвращает результат,
           и у него нет аргументов. При вызове метод выводит в консольное окно все символы из кодовой таблицы,
           которые находятся "между" символами, являющимися значениями полей объекта (из которого вызывается метод)
           Например, если полям объекта присвоены знаяения 'A' и 'D', то при вызове метода в конольное окно должны
           выводиться все символы от 'A' до 'D' включительно. */
    }
}