namespace ClassesAndObject
{
    public class Comments
    {
        // Если поле без модификатора static для того чтобы с ним работать необходимо создать экземпляр класса
        // в котором это поле находится. Так же если поле не статическое, то у каждого экземпляра класса будет
        // свой собственный экземпляр этого поля и в нём можно хранить разные данные.
        
        // Если у поля есть модификатор static, необходимости в экземпляре нет, мы может просто обратиться
        // к этому классу и работать с этим полем. Если поле статическое, то его данные хранятся в отдельной
        // области озу(можно сказать на уровне самого класса, а не на уровне экземпляра. Данное поле будет доступно
        // для всех объектов данного класса.
        
        // "ctor" - генерирует конструктор
        
        // "prop" - генерирует поле с аксессорами
        
        
    }
}